app/transactions/users/create_transaction.rb

    def create(params)
      user = User.new(params)
      if user.save
---
INSERT INTO "users" ("last_name", "first_name", "date_of_birth", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"